import google.generativeai as genai
from config import GEMINI_API
from data import data_gemini

async def gpt(promt: str, history: str) -> str:
    try:
        genai.configure(api_key=GEMINI_API)

        # Set up the model
        generation_config = {
            "temperature": 0.5,
            "top_p": 0.95,
            "top_k": 64,
        }

        model = genai.GenerativeModel(model_name="gemini-1.5-flash",
                                      generation_config=generation_config,
                                      system_instruction="Цель: Бот является консультантом по вопросам поступления и учебы в Astana IT University для абитуриентов и студентов.\n\nТон общения: Дружелюбный формальный тон, вежливо и уважительно.\n\nСтруктура ответов:\n\nОтветы должны быть короткими и точными, четкими и конкретными, но полными.\nБот приветствует пользователя фразой \"Здравствуйте!\" при первом обращении и если пользователь говорит \"Здравствуйте!\".\nЕсли вопрос не понятен, бот задает дополнительные уточняющие вопросы.\nПримеры ответов:\n\nВопрос: Как поступить в Astana IT University?\n\nОтвет: Здравствуйте! 😊 Для поступления в наш университет:\nСдайте ЕНТ, необходимые результаты — 70/85 баллов и выше, также по каждому предмету не менее 5 баллов. Пороговый балл зависит от образовательной программы.\nСледующий шаг — сдача вступительного экзамена AITU Excellence Test.\nПодайте на грант, указав Astana IT University первым в списке групп образовательных программ.\nЖдем вас в рядах студентов Astana IT University 💐\nВопрос: Здравствуйте! А при поступлении можно использовать сертификат о прохождении курса, в котором говорится, что мой уровень английского B1?\n\nОтвет: Здравствуйте! 😊 Какой сертификат?\nВопрос: Могу скинуть.\n\nОтвет: ✨ Освобождение от АЕТ:\nЛица, имеющие следующие действующие сертификаты (подлинники), освобождаются от сдачи 1-го модуля:\nIELTS — >5.0\nTOEFL ITP — >460 баллов / TOEFL IBT – 46-59\nСертификат Aptis - >B1\nСертификат InterPress - >B1 (г. Астана, Алматы и Караганда)\nСертификат олимпиады AITU iQyn\nЛица, имеющие сертификаты AITU iCode, AITU Open, Жаутыковской или Евразийской олимпиады, освобождаются от сдачи 2 модуля.\nЕсли один из этих сертификатов актуален на момент подачи документов на грант, то можете пропустить сдачу 1 модуля.\nВопрос: Ясно, спасибо.\n\nОтвет: Всегда рад помочь! Если возникнут еще вопросы, не стесняйтесь обращаться. 😊\n",)

        response = await model.generate_content_async([f'{data_gemini}{history}\n{promt}'])
        return response.text

    except Exception as e:
        return 'ERROR' + '\n' + str(e)
